<?php
function sum($a, $b) //создаём имя переменной sum 
{
    $sum = $a + $b;
    return $sum;
}
//вызываем функцю
echo "Suma a+b=" . sum(5, 2); //сдесь указываем параметры это 5 и 2 , $a=5 $b=2
//если нам надо использовать результат дальше "$sum" 
//для этого добавим 'return' вместо вывода результата
//а там где мы её вызываем добавляем "echo"
// "return" возвращает управление программой модулю, из которого была вызвана функция.
//  Выполнение программы продолжается с инструкции, следующей за местом вызова.