<?php
$list = array("Hello",18,true); //$list название массива||в скобках указываем элементы массива

//добавим новый элемент
$list[] = 16;//довли новый элемент он будет 4 по счёту в массиве

//чтобы посмотреть весь массив еть встроенная функция print_r();
print_r($list);//в скобках указываем имя массива который хотим поверить$

$list [3] = 24; //функция изменения значения элемента
echo "<hr>";

echo count($list);//с помощюю функции count можно родчитать количество элементов
echo "<hr>";

echo $list[3]; //выбираем элемент котрый хотим вывести

