<pre>
<?php
// "array_map" -Применить функцию обратного вызова ко всем элементам указанных массивов

// Функция array_map() возвращает массив, содержащий элементы всех указанных массивов после
// их обработки функцией обратного вызова. Количество параметров, передаваемых функции обра
// тного вызова, должно совпадать с количеством массивов, переданным функции array_map().

function cube($n)
{
    return $n * $n * $n;
}

$a = array(1, 2, 3, 4, 5);
$b = array_map("cube", $a);
print_r($b);
?>
</pre>