
--Оператор SQL PRIMARY KEY (Первичный ключ) — это параметр, который
-- устанавливается для однозначной идентификации той или иной записи
-- в таблице. Значения SQL PRIMARY KEY должны быть всегда уникальны,
-- а так же не содержать значений NULL.
---------------------------------------------------------------------------
--создадим таблицу
CREATE TABLE shop(             --созд табл shop
id INT NOT NULL AUTO_INCREMENT,--столбец id автоинкремент
title VARCHAR(50),             --столбец title  
price INT,                     --столбец price 
PRIMARY KEY (id)               --(id) Первичный ключ 
);